docs/load-test/20260130-090818-none.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: infra/k6/scripts/allocation-status-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * load_test: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 0031/1000 VUs, 0 complete and 0 interrupted iterations
load_test   [   1% ] 0031/1000 VUs  0m00.9s/2m00.0s

running (0m01.9s), 0064/1000 VUs, 30 complete and 0 interrupted iterations
load_test   [   2% ] 0064/1000 VUs  0m01.9s/2m00.0s

running (0m02.9s), 0098/1000 VUs, 94 complete and 0 interrupted iterations
load_test   [   2% ] 0098/1000 VUs  0m02.9s/2m00.0s

running (0m03.9s), 0131/1000 VUs, 189 complete and 0 interrupted iterations
load_test   [   3% ] 0131/1000 VUs  0m03.9s/2m00.0s

running (0m04.9s), 0164/1000 VUs, 315 complete and 0 interrupted iterations
load_test   [   4% ] 0164/1000 VUs  0m04.9s/2m00.0s

running (0m05.9s), 0198/1000 VUs, 476 complete and 0 interrupted iterations
load_test   [   5% ] 0198/1000 VUs  0m05.9s/2m00.0s

running (0m06.9s), 0231/1000 VUs, 669 complete and 0 interrupted iterations
load_test   [   6% ] 0231/1000 VUs  0m06.9s/2m00.0s

running (0m07.9s), 0264/1000 VUs, 894 complete and 0 interrupted iterations
load_test   [   7% ] 0264/1000 VUs  0m07.9s/2m00.0s

running (0m08.9s), 0298/1000 VUs, 1156 complete and 0 interrupted iterations
load_test   [   7% ] 0298/1000 VUs  0m08.9s/2m00.0s

running (0m09.9s), 0331/1000 VUs, 1442 complete and 0 interrupted iterations
load_test   [   8% ] 0331/1000 VUs  0m09.9s/2m00.0s

running (0m10.9s), 0364/1000 VUs, 1767 complete and 0 interrupted iterations
load_test   [   9% ] 0364/1000 VUs  0m10.9s/2m00.0s

running (0m11.9s), 0398/1000 VUs, 2123 complete and 0 interrupted iterations
load_test   [  10% ] 0398/1000 VUs  0m11.9s/2m00.0s

running (0m12.9s), 0431/1000 VUs, 2510 complete and 0 interrupted iterations
load_test   [  11% ] 0431/1000 VUs  0m12.9s/2m00.0s

running (0m13.9s), 0464/1000 VUs, 2931 complete and 0 interrupted iterations
load_test   [  12% ] 0464/1000 VUs  0m13.9s/2m00.0s

running (0m14.9s), 0498/1000 VUs, 3381 complete and 0 interrupted iterations
load_test   [  12% ] 0498/1000 VUs  0m14.9s/2m00.0s

running (0m15.9s), 0531/1000 VUs, 3850 complete and 0 interrupted iterations
load_test   [  13% ] 0531/1000 VUs  0m15.9s/2m00.0s

running (0m16.9s), 0564/1000 VUs, 4378 complete and 0 interrupted iterations
load_test   [  14% ] 0564/1000 VUs  0m16.9s/2m00.0s

running (0m17.9s), 0598/1000 VUs, 4932 complete and 0 interrupted iterations
load_test   [  15% ] 0598/1000 VUs  0m17.9s/2m00.0s

running (0m18.9s), 0631/1000 VUs, 5517 complete and 0 interrupted iterations
load_test   [  16% ] 0631/1000 VUs  0m18.9s/2m00.0s

running (0m19.9s), 0664/1000 VUs, 6134 complete and 0 interrupted iterations
load_test   [  17% ] 0664/1000 VUs  0m19.9s/2m00.0s

running (0m20.9s), 0698/1000 VUs, 6768 complete and 0 interrupted iterations
load_test   [  17% ] 0698/1000 VUs  0m20.9s/2m00.0s

running (0m21.9s), 0731/1000 VUs, 7445 complete and 0 interrupted iterations
load_test   [  18% ] 0731/1000 VUs  0m21.9s/2m00.0s

running (0m22.9s), 0764/1000 VUs, 8154 complete and 0 interrupted iterations
load_test   [  19% ] 0764/1000 VUs  0m22.9s/2m00.0s

running (0m23.9s), 0798/1000 VUs, 8895 complete and 0 interrupted iterations
load_test   [  20% ] 0798/1000 VUs  0m23.9s/2m00.0s

running (0m24.9s), 0831/1000 VUs, 9634 complete and 0 interrupted iterations
load_test   [  21% ] 0831/1000 VUs  0m24.9s/2m00.0s

running (0m25.9s), 0864/1000 VUs, 10411 complete and 0 interrupted iterations
load_test   [  22% ] 0864/1000 VUs  0m25.9s/2m00.0s

running (0m26.9s), 0898/1000 VUs, 11179 complete and 0 interrupted iterations
load_test   [  22% ] 0898/1000 VUs  0m26.9s/2m00.0s

running (0m27.9s), 0931/1000 VUs, 11901 complete and 0 interrupted iterations
load_test   [  23% ] 0931/1000 VUs  0m27.9s/2m00.0s

running (0m28.9s), 0964/1000 VUs, 12769 complete and 0 interrupted iterations
load_test   [  24% ] 0964/1000 VUs  0m28.9s/2m00.0s

running (0m29.9s), 0998/1000 VUs, 13467 complete and 0 interrupted iterations
load_test   [  25% ] 0998/1000 VUs  0m29.9s/2m00.0s

running (0m30.9s), 1000/1000 VUs, 14254 complete and 0 interrupted iterations
load_test   [  26% ] 1000/1000 VUs  0m30.9s/2m00.0s

running (0m31.9s), 1000/1000 VUs, 15051 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m31.9s/2m00.0s

running (0m32.9s), 1000/1000 VUs, 15902 complete and 0 interrupted iterations
load_test   [  27% ] 1000/1000 VUs  0m32.9s/2m00.0s

running (0m33.9s), 1000/1000 VUs, 16599 complete and 0 interrupted iterations
load_test   [  28% ] 1000/1000 VUs  0m33.9s/2m00.0s

running (0m34.9s), 1000/1000 VUs, 17521 complete and 0 interrupted iterations
load_test   [  29% ] 1000/1000 VUs  0m34.9s/2m00.0s

running (0m35.9s), 1000/1000 VUs, 18198 complete and 0 interrupted iterations
load_test   [  30% ] 1000/1000 VUs  0m35.9s/2m00.0s

running (0m36.9s), 1000/1000 VUs, 19046 complete and 0 interrupted iterations
load_test   [  31% ] 1000/1000 VUs  0m36.9s/2m00.0s

running (0m37.9s), 1000/1000 VUs, 19850 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m37.9s/2m00.0s

running (0m38.9s), 1000/1000 VUs, 20523 complete and 0 interrupted iterations
load_test   [  32% ] 1000/1000 VUs  0m38.9s/2m00.0s

running (0m39.9s), 1000/1000 VUs, 21373 complete and 0 interrupted iterations
load_test   [  33% ] 1000/1000 VUs  0m39.9s/2m00.0s

running (0m40.9s), 1000/1000 VUs, 22162 complete and 0 interrupted iterations
load_test   [  34% ] 1000/1000 VUs  0m40.9s/2m00.0s

running (0m41.9s), 1000/1000 VUs, 22765 complete and 0 interrupted iterations
load_test   [  35% ] 1000/1000 VUs  0m41.9s/2m00.0s

running (0m42.9s), 1000/1000 VUs, 23710 complete and 0 interrupted iterations
load_test   [  36% ] 1000/1000 VUs  0m42.9s/2m00.0s

running (0m43.9s), 1000/1000 VUs, 24476 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m43.9s/2m00.0s

running (0m44.9s), 1000/1000 VUs, 25118 complete and 0 interrupted iterations
load_test   [  37% ] 1000/1000 VUs  0m44.9s/2m00.0s

running (0m45.9s), 1000/1000 VUs, 26067 complete and 0 interrupted iterations
load_test   [  38% ] 1000/1000 VUs  0m45.9s/2m00.0s

running (0m46.9s), 1000/1000 VUs, 26820 complete and 0 interrupted iterations
load_test   [  39% ] 1000/1000 VUs  0m46.9s/2m00.0s

running (0m47.9s), 1000/1000 VUs, 27450 complete and 0 interrupted iterations
load_test   [  40% ] 1000/1000 VUs  0m47.9s/2m00.0s

running (0m48.9s), 1000/1000 VUs, 28423 complete and 0 interrupted iterations
load_test   [  41% ] 1000/1000 VUs  0m48.9s/2m00.0s

running (0m49.9s), 1000/1000 VUs, 29148 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m49.9s/2m00.0s

running (0m50.9s), 1000/1000 VUs, 29771 complete and 0 interrupted iterations
load_test   [  42% ] 1000/1000 VUs  0m50.9s/2m00.0s

running (0m51.9s), 1000/1000 VUs, 30735 complete and 0 interrupted iterations
load_test   [  43% ] 1000/1000 VUs  0m51.9s/2m00.0s

running (0m52.9s), 1000/1000 VUs, 31428 complete and 0 interrupted iterations
load_test   [  44% ] 1000/1000 VUs  0m52.9s/2m00.0s

running (0m53.9s), 1000/1000 VUs, 32110 complete and 0 interrupted iterations
load_test   [  45% ] 1000/1000 VUs  0m53.9s/2m00.0s

running (0m54.9s), 1000/1000 VUs, 33025 complete and 0 interrupted iterations
load_test   [  46% ] 1000/1000 VUs  0m54.9s/2m00.0s

running (0m55.9s), 1000/1000 VUs, 33675 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m55.9s/2m00.0s

running (0m56.9s), 1000/1000 VUs, 34566 complete and 0 interrupted iterations
load_test   [  47% ] 1000/1000 VUs  0m56.9s/2m00.0s

running (0m57.9s), 1000/1000 VUs, 35320 complete and 0 interrupted iterations
load_test   [  48% ] 1000/1000 VUs  0m57.9s/2m00.0s

running (0m58.9s), 1000/1000 VUs, 35817 complete and 0 interrupted iterations
load_test   [  49% ] 1000/1000 VUs  0m58.9s/2m00.0s

running (0m59.9s), 1000/1000 VUs, 36765 complete and 0 interrupted iterations
load_test   [  50% ] 1000/1000 VUs  0m59.9s/2m00.0s

running (1m00.9s), 1000/1000 VUs, 37225 complete and 0 interrupted iterations
load_test   [  51% ] 1000/1000 VUs  1m00.9s/2m00.0s

running (1m01.9s), 1000/1000 VUs, 38184 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m01.9s/2m00.0s

running (1m02.9s), 1000/1000 VUs, 38760 complete and 0 interrupted iterations
load_test   [  52% ] 1000/1000 VUs  1m02.9s/2m00.0s

running (1m03.9s), 1000/1000 VUs, 39363 complete and 0 interrupted iterations
load_test   [  53% ] 1000/1000 VUs  1m03.9s/2m00.0s

running (1m04.9s), 1000/1000 VUs, 40271 complete and 0 interrupted iterations
load_test   [  54% ] 1000/1000 VUs  1m04.9s/2m00.0s

running (1m05.9s), 1000/1000 VUs, 40875 complete and 0 interrupted iterations
load_test   [  55% ] 1000/1000 VUs  1m05.9s/2m00.0s

running (1m06.9s), 1000/1000 VUs, 41647 complete and 0 interrupted iterations
load_test   [  56% ] 1000/1000 VUs  1m06.9s/2m00.0s

running (1m07.9s), 1000/1000 VUs, 42492 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m07.9s/2m00.0s

running (1m08.9s), 1000/1000 VUs, 43088 complete and 0 interrupted iterations
load_test   [  57% ] 1000/1000 VUs  1m08.9s/2m00.0s

running (1m09.9s), 1000/1000 VUs, 44060 complete and 0 interrupted iterations
load_test   [  58% ] 1000/1000 VUs  1m09.9s/2m00.0s

running (1m10.9s), 1000/1000 VUs, 44667 complete and 0 interrupted iterations
load_test   [  59% ] 1000/1000 VUs  1m10.9s/2m00.0s

running (1m11.9s), 1000/1000 VUs, 45424 complete and 0 interrupted iterations
load_test   [  60% ] 1000/1000 VUs  1m11.9s/2m00.0s

running (1m12.9s), 1000/1000 VUs, 46265 complete and 0 interrupted iterations
load_test   [  61% ] 1000/1000 VUs  1m12.9s/2m00.0s

running (1m13.9s), 1000/1000 VUs, 46881 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m13.9s/2m00.0s

running (1m14.9s), 1000/1000 VUs, 47823 complete and 0 interrupted iterations
load_test   [  62% ] 1000/1000 VUs  1m14.9s/2m00.0s

running (1m15.9s), 1000/1000 VUs, 48405 complete and 0 interrupted iterations
load_test   [  63% ] 1000/1000 VUs  1m15.9s/2m00.0s

running (1m16.9s), 1000/1000 VUs, 49351 complete and 0 interrupted iterations
load_test   [  64% ] 1000/1000 VUs  1m16.9s/2m00.0s

running (1m17.9s), 1000/1000 VUs, 50090 complete and 0 interrupted iterations
load_test   [  65% ] 1000/1000 VUs  1m17.9s/2m00.0s

running (1m18.9s), 1000/1000 VUs, 50686 complete and 0 interrupted iterations
load_test   [  66% ] 1000/1000 VUs  1m18.9s/2m00.0s

running (1m19.9s), 1000/1000 VUs, 51659 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m19.9s/2m00.0s

running (1m20.9s), 1000/1000 VUs, 52373 complete and 0 interrupted iterations
load_test   [  67% ] 1000/1000 VUs  1m20.9s/2m00.0s

running (1m21.9s), 1000/1000 VUs, 52944 complete and 0 interrupted iterations
load_test   [  68% ] 1000/1000 VUs  1m21.9s/2m00.0s

running (1m22.9s), 1000/1000 VUs, 53902 complete and 0 interrupted iterations
load_test   [  69% ] 1000/1000 VUs  1m22.9s/2m00.0s

running (1m23.9s), 1000/1000 VUs, 54461 complete and 0 interrupted iterations
load_test   [  70% ] 1000/1000 VUs  1m23.9s/2m00.0s

running (1m24.9s), 1000/1000 VUs, 55407 complete and 0 interrupted iterations
load_test   [  71% ] 1000/1000 VUs  1m24.9s/2m00.0s

running (1m25.9s), 1000/1000 VUs, 56183 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m25.9s/2m00.0s

running (1m26.9s), 1000/1000 VUs, 56792 complete and 0 interrupted iterations
load_test   [  72% ] 1000/1000 VUs  1m26.9s/2m00.0s

running (1m27.9s), 1000/1000 VUs, 57776 complete and 0 interrupted iterations
load_test   [  73% ] 1000/1000 VUs  1m27.9s/2m00.0s

running (1m28.9s), 1000/1000 VUs, 58457 complete and 0 interrupted iterations
load_test   [  74% ] 1000/1000 VUs  1m28.9s/2m00.0s

running (1m29.9s), 1000/1000 VUs, 59179 complete and 0 interrupted iterations
load_test   [  75% ] 1000/1000 VUs  1m29.9s/2m00.0s

running (1m30.9s), 0990/1000 VUs, 60115 complete and 0 interrupted iterations
load_test   [  76% ] 0990/1000 VUs  1m30.9s/2m00.0s

running (1m31.9s), 0961/1000 VUs, 60768 complete and 0 interrupted iterations
load_test   [  77% ] 0961/1000 VUs  1m31.9s/2m00.0s

running (1m32.9s), 0918/1000 VUs, 61701 complete and 0 interrupted iterations
load_test   [  77% ] 0918/1000 VUs  1m32.9s/2m00.0s

running (1m33.9s), 0887/1000 VUs, 62398 complete and 0 interrupted iterations
load_test   [  78% ] 0887/1000 VUs  1m33.9s/2m00.0s

running (1m34.9s), 0859/1000 VUs, 63138 complete and 0 interrupted iterations
load_test   [  79% ] 0859/1000 VUs  1m34.9s/2m00.0s

running (1m35.9s), 0822/1000 VUs, 63925 complete and 0 interrupted iterations
load_test   [  80% ] 0822/1000 VUs  1m35.9s/2m00.0s

running (1m36.9s), 0787/1000 VUs, 64713 complete and 0 interrupted iterations
load_test   [  81% ] 0787/1000 VUs  1m36.9s/2m00.0s

running (1m37.9s), 0753/1000 VUs, 65456 complete and 0 interrupted iterations
load_test   [  82% ] 0753/1000 VUs  1m37.9s/2m00.0s

running (1m38.9s), 0719/1000 VUs, 66189 complete and 0 interrupted iterations
load_test   [  82% ] 0719/1000 VUs  1m38.9s/2m00.0s

running (1m39.9s), 0686/1000 VUs, 66889 complete and 0 interrupted iterations
load_test   [  83% ] 0686/1000 VUs  1m39.9s/2m00.0s

running (1m40.9s), 0654/1000 VUs, 67555 complete and 0 interrupted iterations
load_test   [  84% ] 0654/1000 VUs  1m40.9s/2m00.0s

running (1m41.9s), 0621/1000 VUs, 68186 complete and 0 interrupted iterations
load_test   [  85% ] 0621/1000 VUs  1m41.9s/2m00.0s

running (1m42.9s), 0588/1000 VUs, 68786 complete and 0 interrupted iterations
load_test   [  86% ] 0588/1000 VUs  1m42.9s/2m00.0s

running (1m43.9s), 0555/1000 VUs, 69348 complete and 0 interrupted iterations
load_test   [  87% ] 0555/1000 VUs  1m43.9s/2m00.0s

running (1m44.9s), 0519/1000 VUs, 69869 complete and 0 interrupted iterations
load_test   [  87% ] 0519/1000 VUs  1m44.9s/2m00.0s

running (1m45.9s), 0487/1000 VUs, 70380 complete and 0 interrupted iterations
load_test   [  88% ] 0487/1000 VUs  1m45.9s/2m00.0s

running (1m46.9s), 0453/1000 VUs, 70866 complete and 0 interrupted iterations
load_test   [  89% ] 0453/1000 VUs  1m46.9s/2m00.0s

running (1m47.9s), 0421/1000 VUs, 71315 complete and 0 interrupted iterations
load_test   [  90% ] 0421/1000 VUs  1m47.9s/2m00.0s

running (1m48.9s), 0389/1000 VUs, 71733 complete and 0 interrupted iterations
load_test   [  91% ] 0389/1000 VUs  1m48.9s/2m00.0s

running (1m49.9s), 0353/1000 VUs, 72119 complete and 0 interrupted iterations
load_test   [  92% ] 0353/1000 VUs  1m49.9s/2m00.0s

running (1m50.9s), 0321/1000 VUs, 72466 complete and 0 interrupted iterations
load_test   [  92% ] 0321/1000 VUs  1m50.9s/2m00.0s

running (1m51.9s), 0286/1000 VUs, 72777 complete and 0 interrupted iterations
load_test   [  93% ] 0286/1000 VUs  1m51.9s/2m00.0s

running (1m52.9s), 0253/1000 VUs, 73056 complete and 0 interrupted iterations
load_test   [  94% ] 0253/1000 VUs  1m52.9s/2m00.0s

running (1m53.9s), 0222/1000 VUs, 73305 complete and 0 interrupted iterations
load_test   [  95% ] 0222/1000 VUs  1m53.9s/2m00.0s

running (1m54.9s), 0189/1000 VUs, 73524 complete and 0 interrupted iterations
load_test   [  96% ] 0189/1000 VUs  1m54.9s/2m00.0s

running (1m55.9s), 0151/1000 VUs, 73709 complete and 0 interrupted iterations
load_test   [  97% ] 0151/1000 VUs  1m55.9s/2m00.0s

running (1m56.9s), 0121/1000 VUs, 73858 complete and 0 interrupted iterations
load_test   [  97% ] 0121/1000 VUs  1m56.9s/2m00.0s

running (1m57.9s), 0083/1000 VUs, 73979 complete and 0 interrupted iterations
load_test   [  98% ] 0083/1000 VUs  1m57.9s/2m00.0s

running (1m58.9s), 0048/1000 VUs, 74061 complete and 0 interrupted iterations
load_test   [  99% ] 0048/1000 VUs  1m58.9s/2m00.0s

running (1m59.9s), 0017/1000 VUs, 74109 complete and 0 interrupted iterations
load_test   [ 100% ] 0017/1000 VUs  1m59.9s/2m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=798.61ms
    ✓ 'p(99)<5000' p(99)=1.25s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 148252 1227.510603/s
    checks_succeeded...: 98.51% 146054 out of 148252
    checks_failed......: 1.48%  2198 out of 148252

    ✓ status is 200
    ✗ response time < 1000ms
      ↳  97% — ✓ 71928 / ✗ 2198

    HTTP
    http_req_duration..............: avg=220.26ms min=5.5ms med=110.78ms max=4.36s p(90)=578.67ms p(95)=798.61ms
      { expected_response:true }...: avg=220.26ms min=5.5ms med=110.78ms max=4.36s p(90)=578.67ms p(95)=798.61ms
    http_req_failed................: 0.00%  0 out of 74126
    http_reqs......................: 74126  613.755302/s

    EXECUTION
    iteration_duration.............: avg=1.22s    min=1s    med=1.11s    max=5.36s p(90)=1.58s    p(95)=1.8s    
    iterations.....................: 74126  613.755302/s
    vus............................: 17     min=17         max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 974 MB 8.1 MB/s
    data_sent......................: 8.1 MB 67 kB/s



running (2m00.8s), 0000/1000 VUs, 74126 complete and 0 interrupted iterations
load_test ✓ [ 100% ] 0000/1000 VUs  2m0s